Extension/InformationRegisters/ТранзакцииESD.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТранзакцииESD</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AgreementScId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>NomenclatureScId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ServerTxId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TxRef</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Manufacture</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extension/InformationRegisters/СерииESD.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СерииESD</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ServerTxId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SerialSetScId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SerialId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TransactionKind</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extension/InformationRegisters/КорректировкиESD.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КорректировкиESD</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ServerTxId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extension/WebServices/ESDTransactions/Ext/Module.bsl
Функция LoadTransactions(TableESD, DateLoad)
	
	//Инициализация и создание выходного значения
	ResultOfOperationТип = ФабрикаXDTO.Тип("ESDTransactions", "ResultOfOperation" );
	ResultOfOperation = ФабрикаXDTO.Создать(ResultOfOperationТип);
    ResultOfOperation.Success = Ложь;
	ResultOfOperation.Comments = "";
	
	
	Если НЕ ЗначениеЗаполнено(DateLoad) Тогда
		ResultOfOperation.Comments = "Ошибка: Дата загрузки пустая.";
		Возврат ResultOfOperation;
	КонецЕсли;
	
	Если TableESD.Element.Количество() = 0 Тогда 	
		ResultOfOperation.Comments = "Ошибка: Пустая входящая TableESD.";
		Возврат ResultOfOperation;
	КонецЕсли;

	// очистка записей в загружаемой дате
	НаборЗаписей = РегистрыСведений.ТранзакцииESD.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Date.Установить(DateLoad);
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("ЗагрузкаТранзакцийESD.ОшибкаОчисткиТранзакций",
			УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ТранзакцииESD,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ResultOfOperation.Comments = "Ошибка записи переданных транзакций.";
		Возврат ResultOfOperation;
	КонецПопытки;
	
	Для Каждого Транзакция Из TableESD.Element Цикл
		
		НаборЗаписей = РегистрыСведений.ТранзакцииESD.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Date.Установить(DateLoad);
		НаборЗаписей.Отбор.AgreementScId.Установить(Транзакция.AgreementScId);
		НаборЗаписей.Отбор.NomenclatureScId.Установить(Транзакция.NomenclatureScId);
		НаборЗаписей.Отбор.ServerTxId.Установить(Транзакция.ServerTxId);
		НаборЗаписей.Отбор.TxRef.Установить(Транзакция.TxRef);
		НаборЗаписей.Отбор.Manufacture.Установить(Транзакция.Manufacture);
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Транзакция);
		Запись.Date = DateLoad;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ЗагрузкаТранзакцийESD.ОшибкаЗагрузкиТранзакций",
				УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ТранзакцииESD,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ResultOfOperation.Comments = "Ошибка записи переданных транзакций.";
			Возврат ResultOfOperation;
		КонецПопытки;
		
		Для Каждого Серия Из Транзакция.Serials Цикл
			
			НаборЗаписей = РегистрыСведений.СерииESD.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ServerTxId.Установить(Транзакция.ServerTxId);
			НаборЗаписей.Отбор.SerialSetScId.Установить(Серия.SerialSetScId);
			НаборЗаписей.Отбор.SerialId.Установить(Серия.SerialId);
			НаборЗаписей.Отбор.TransactionKind.Установить(Серия.TransactionKind);
		
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Серия);
			Запись.ServerTxId = Транзакция.ServerTxId;
			
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("ЗагрузкаТранзакцийESD.ОшибкаЗагрузкиСерии",
					УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.СерииESD,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				ResultOfOperation.Comments = "Ошибка записи переданных транзакций.";
				Возврат ResultOfOperation;
			КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;
	
    ResultOfOperation.Success = Истина;
	
	Возврат ResultOfOperation;	
	
КонецФункции

Функция LoadAdjustments(TableAdjustments)
	
	//Инициализация и создание выходного значения
	ResultOfOperationТип = ФабрикаXDTO.Тип("ESDTransactions", "ResultOfOperation" );
	ResultOfOperation = ФабрикаXDTO.Создать(ResultOfOperationТип);
    ResultOfOperation.Success = Ложь;
	ResultOfOperation.Comments = "";
	
	Если TableAdjustments.Elements.Количество() = 0 Тогда 	
		ResultOfOperation.Comments = "Ошибка: Пустая входящая TableAdjustments.";
		Возврат ResultOfOperation;
	КонецЕсли;

	Для Каждого Транзакция Из TableAdjustments.Elements Цикл
			
		НаборЗаписей = РегистрыСведений.КорректировкиESD.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ServerTxId.Установить(Транзакция.ServerTxId);
	
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Транзакция);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ЗагрузкаТранзакцийESD.ОшибкаЗагрузкиКорректировок",
				УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.КорректировкиESD,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ResultOfOperation.Comments = "Ошибка записи переданных корректировок.";
			Возврат ResultOfOperation;
		КонецПопытки;
		
	КонецЦикла;
	
    ResultOfOperation.Success = Истина;
	Возврат ResultOfOperation;	
	
КонецФункции
